{"class_name": "Sequential", "config": [{"class_name": "Masking", "config": {"name": "masking_1", "trainable": true, "mask_value": -1, "batch_input_shape": [null, 5, 14], "dtype": "float32"}}, {"class_name": "LSTM", "config": {"trainable": true, "unit_forget_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "activation": "tanh", "implementation": 1, "return_sequences": false, "kernel_regularizer": null, "recurrent_constraint": null, "go_backwards": false, "units": 32, "kernel_constraint": null, "bias_regularizer": null, "return_state": false, "activity_regularizer": null, "name": "lstm_1", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unroll": false, "stateful": false, "recurrent_dropout": 0.0, "bias_constraint": null, "recurrent_activation": "hard_sigmoid", "recurrent_regularizer": null, "dropout": 0.2, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}}}, {"class_name": "Dense", "config": {"trainable": true, "bias_regularizer": null, "activity_regularizer": null, "name": "dense_1", "use_bias": true, "dtype": "float32", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "kernel_regularizer": null, "units": 8, "bias_constraint": null, "kernel_constraint": null, "batch_input_shape": [null, 32]}}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "softmax"}}], "keras_version": "2.1.0", "backend": "tensorflow"}